In [1]:
import numpy as np
import pandas as pd

In [2]:
dict = {
        "name":["Ravi", "Kumar", "Shivay", "Pranjal", "Abhay"],
        "marks":[56,55,79,21,39],
        "city":["Agra","Mumbai","Jaipur","Surat","Ahmedabad"],
        }

# DataFrame

In [3]:
df = pd.DataFrame(dict) # converts into Dataframe means excelsheet

In [4]:
df

      name  marks       city
0     Ravi     56       Agra
1    Kumar     55     Mumbai
2   Shivay     79     Jaipur
3  Pranjal     21      Surat
4    Abhay     39  Ahmedabad

In [5]:
# df.to_csv("hello.csv") # used to convert table into csv

In [6]:
# df.to_csv("hello.csv", index=False) # used to convert table into csv without index

In [7]:
df.head(2) # used to show data from top

    name  marks    city
0   Ravi     56    Agra
1  Kumar     55  Mumbai

In [8]:
df.tail(2) # used to show data from down

      name  marks       city
3  Pranjal     21      Surat
4    Abhay     39  Ahmedabad

In [9]:
df.describe()

           marks
count   5.000000
mean   50.000000
std    21.587033
min    21.000000
25%    39.000000
50%    55.000000
75%    56.000000
max    79.000000

In [10]:
check = pd.read_csv('Marks.csv')

In [11]:
check

     number_courses  time_study   Marks
0                 3       4.508  19.202
1                 4       0.096   7.734
2                 4       3.133  13.811
3                 6       7.909  53.018
4                 8       7.811  55.299
..              ...         ...     ...
96                3       0.301   5.609
97                4       7.163  41.444
98                7       0.309  12.027
99                3       6.335  32.357
100               4       3.210     NaN

[101 rows x 3 columns]

In [14]:
check['Marks']

0      19.202
1       7.734
2      13.811
3      53.018
4      55.299
        ...
96      5.609
97     41.444
98     12.027
99     32.357
100       NaN
Name: Marks, Length: 101, dtype: float64

In [15]:
check['Marks'][30] # index value

np.float64(24.172)

In [16]:
check['Marks'][3]=51.22 # change the value

C:\Users\asus\AppData\Local\Temp\ipykernel_6216\877709475.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  check['Marks'][3]=51.22

In [17]:
check

     number_courses  time_study   Marks
0                 3       4.508  19.202
1                 4       0.096   7.734
2                 4       3.133  13.811
3                 6       7.909  51.220
4                 8       7.811  55.299
..              ...         ...     ...
96                3       0.301   5.609
97                4       7.163  41.444
98                7       0.309  12.027
99                3       6.335  32.357
100               4       3.210     NaN

[101 rows x 3 columns]

In [18]:
df.index=['a','b','c','d','e'] # used to change index type

In [19]:
df

      name  marks       city
a     Ravi     56       Agra
b    Kumar     55     Mumbai
c   Shivay     79     Jaipur
d  Pranjal     21      Surat
e    Abhay     39  Ahmedabad